Public Attributes | List of all members
ACAPI::MEP::FlexibleSegmentPolylineSplinePart Struct Reference
MEP Element Manager
Defines a single spline segment of a polyline FlexibleSegment. More...
#include <MEPTypes.hpp>
 Public Attributes
 std::vector< API_Coord3D >  | controlPoints
World coordinates of control points.
Detailed Description
Defines a single spline segment of a polyline FlexibleSegment.